In [1]:
%load_ext sql
%sql sqlite://

In [2]:
%%sql
DROP TABLE IF EXISTS R; DROP TABLE IF EXISTS S; DROP TABLE IF EXISTS T;
CREATE TABLE R (A int); CREATE TABLE S (A int); CREATE TABLE T (A int);

INSERT INTO R values (1);
INSERT INTO R values (2);
INSERT INTO R values (3);
INSERT INTO R values (4);
INSERT INTO R values (5);

INSERT INTO S values (1);
INSERT INTO S values (3);
INSERT INTO S values (5);
INSERT INTO S values (7);
INSERT INTO S values (9);

INSERT INTO T values (1);
INSERT INTO T values (4);
INSERT INTO T values (7);
INSERT INTO T values (10);

SELECT * FROM T;

 * sqlite://
Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1,), (4,), (7,), (10,)]

In [3]:
%%sql
drop table if exists product; -- This needs to be dropped if exists, see why further down!
drop table if exists company;
pragma foreign_keys = ON; -- WARNING by default off in sqlite
create table company (
    cname varchar primary key, -- company name uniquely identifies the company.
    stockprice money, -- stock price is in money 
    country varchar); -- country is just a string
insert into company values ('ToyWorks', 25.0, 'USA');
insert into company values ('ToyFriends', 65.0, 'China');
insert into company values ('ToyCo', 15.0, 'China');

create table product(
       pname varchar, -- name of the product
       price money, -- price of the product
       category varchar, -- category
       manufacturer varchar, -- manufacturer
       primary key (pname, manufacturer),
       foreign key (manufacturer) references company(cname));
insert into product values('Pikachu', 19.99, 'Toy', 'ToyWorks');
insert into product values('Pikachu', 19.99, 'Toy', 'ToyFriends');
insert into product values('Pokeball', 29.99, 'Electronic', 'ToyCo');
insert into product values('Bulbasaur', 149.99, 'Toy', 'ToyFriends');
insert into product values('Charizard', 203.99, 'Toy', 'ToyCo');
insert into product values('PokeCamera', 19.99, 'Electronic', 'ToyWorks');

SELECT * FROM product;

 * sqlite://
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[('Pikachu', 19.99, 'Toy', 'ToyWorks'),
 ('Pikachu', 19.99, 'Toy', 'ToyFriends'),
 ('Pokeball', 29.99, 'Electronic', 'ToyCo'),
 ('Bulbasaur', 149.99, 'Toy', 'ToyFriends'),
 ('Charizard', 203.99, 'Toy', 'ToyCo'),
 ('PokeCamera', 19.99, 'Electronic', 'ToyWorks')]

Activity 2-3:
-------------

Multi-table queries

Exercise #1:
-----------
For three tables $R,S,T$ that only have one attribute $A$:
* R = {1,2,3,4,5}
* S = {1,3,5,7,9}
* T = {1,4,7,10}
 
Can you write a query to select $R \cap (S \cup T)$- in other words elements that are in $R$ and either $S$ or $T$?

Write your query here:

In [4]:
%%sql
SELECT DISTINCT A
FROM R
WHERE A IN S OR A IN T;

 * sqlite://
Done.

[(1,), (3,), (4,), (5,)]

Now test your query above for the case where $S = \emptyset$- what happens and why?

Execute the below, then re-run your query above

In [5]:
%%sql
delete from S;
SELECT * FROM S;

 * sqlite://
5 rows affected.
Done.

[]

In [6]:
%%sql
SELECT DISTINCT A
FROM R
WHERE A IN S OR A IN T;

 * sqlite://
Done.

[(1,), (4,)]

In [7]:
# Since S is gone, it only takes the intersection of R and T

Exercise #2
-----------

* Schema is same as before

> Product (<u>pname</u>,  price, category, manufacturer)<br>
> Company (<u>cname</u>, stockPrice, country)

* Our goal is to answer the following question:

> Find all categories of products that are made by Chinese companies

Write your query here:

In [8]:
%%sql
SELECT DISTINCT category
FROM company
JOIN product on company.cname = product.manufacturer
WHERE country = "China";

 * sqlite://
Done.

[('Toy',), ('Electronic',)]